In [7]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

/Users/magnierloan/Desktop/HackathonMF/notebooks
/Users/magnierloan/Desktop/HackathonMF/notebooks

In [10]:
df1 = pd.read_csv("../../Hackathon/Train/X_2D_arome_interp_2016.csv")
df1

,Unnamed: 0,number_sta,time,valid_time,ws,p3031,u10,v10,t2m,d2m,r,tp,msl
0,0,86118001,2016-06-19,2016-06-19 00:00:00,2.360735,300.570129,2.031857,-1.197647,287.520206,284.392389,81.496266,NaN,102614.380009
1,1,86149001,2016-06-19,2016-06-19 00:00:00,2.059683,278.237361,2.036379,-0.298119,285.289130,283.076365,86.347620,NaN,102619.765078
2,2,56081003,2016-06-19,2016-06-19 00:00:00,2.586343,287.103175,2.467196,-0.757305,283.136152,281.679318,90.649944,NaN,102775.500604
3,3,53215001,2016-06-19,2016-06-19 00:00:00,1.873133,282.026020,1.828928,-0.390428,283.009130,282.154606,94.419616,NaN,102656.699157
4,4,22135001,2016-06-19,2016-06-19 00:00:00,1.197948,225.409073,0.868830,0.800126,282.722457,281.852696,94.300453,NaN,102742.146704
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2746245,2746245,86137003,2016-12-04,2016-12-05 00:00:00,2.384466,102.721949,-2.311351,0.542785,274.807369,274.330059,96.638182,0.013103,102085.626464
2746246,2746246,86165005,2016-12-04,2016-12-05 00:00:00,2.264505,62.095931,-2.012222,-1.027742,274.753123,273.980873,94.593653,0.013449,102101.049983
2746247,2746247,86273001,2016-12-04,2016-12-05 00:00:00,1.664062,81.866581,-1.533742,-0.153866,275.365047,274.171669,91.821377,0.018676,102118.606509
2746248,2746248,91200002,2016-12-04,2016-12-05 00:00:00,1.613571,70.839039,-1.524053,-0.529592,272.754375,272.365318,96.831198,0.000491,102355.386009
2746249,2746249,95690001,2016-12-04,2016-12-05 00:00:00,2.713235,105.086341,-2.617658,0.687659,273.246948,272.443672,93.676000,0.000000,102386.648644

In [3]:
stations_train_df = pd.read_csv("train/X_station_train.csv", index_col=["Id"])
stations_train_df

,Unnamed: 0,number_sta,time,valid_time,ws,p3031,u10,v10,t2m,d2m,r,tp,msl
0,0,86118001,2016-06-19,2016-06-19 00:00:00,2.360735,300.570129,2.031857,-1.197647,287.520206,284.392389,81.496266,NaN,102614.380009
1,1,86149001,2016-06-19,2016-06-19 00:00:00,2.059683,278.237361,2.036379,-0.298119,285.289130,283.076365,86.347620,NaN,102619.765078
2,2,56081003,2016-06-19,2016-06-19 00:00:00,2.586343,287.103175,2.467196,-0.757305,283.136152,281.679318,90.649944,NaN,102775.500604
3,3,53215001,2016-06-19,2016-06-19 00:00:00,1.873133,282.026020,1.828928,-0.390428,283.009130,282.154606,94.419616,NaN,102656.699157
4,4,22135001,2016-06-19,2016-06-19 00:00:00,1.197948,225.409073,0.868830,0.800126,282.722457,281.852696,94.300453,NaN,102742.146704

In [12]:
stations_coordinates_df = pd.read_csv("../../Hackathon/Other/stations_coordinates.csv", index_col = "number_sta")
print("Number of meteo stations: ", stations_coordinates_df.index.size)
stations_coordinates_df

Number of meteo stations:  325

               lat    lon  height_sta
number_sta
86118001    46.477  0.985       120.0
86149001    46.917  0.025        60.0
56081003    48.050 -3.660       165.0
53215001    47.790 -0.710        63.0
22135001    48.550 -3.380       148.0
...            ...    ...         ...
86137003    47.035  0.098        96.0
86165005    46.412  0.841       153.0
86273001    46.464  1.042       121.0
91200002    48.526  1.993       116.0
95690001    49.108  1.831       126.0

[325 rows x 3 columns]

In [14]:
!pip install geopandas

Requirement already satisfied: geopandas in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (0.12.1)
Requirement already satisfied: fiona>=1.8 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from geopandas) (1.8.22)
Requirement already satisfied: pandas>=1.0.0 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from geopandas) (1.4.4)
Requirement already satisfied: pyproj>=2.6.1.post1 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from geopandas) (3.4.0)
Requirement already satisfied: packaging in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from geopandas) (21.3)
Requirement already satisfied: shapely>=1.7 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from geopandas) (1.8.5.post1)
Requirement already satisfied: certifi in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from fiona>=1.8->geopandas) (2022.6.15.1)
Requirement already satisfied: six>=1.7 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from fiona>=1.8->geopandas) (1.16.0)
Requirement already satisfied: click-plugins>=1.0 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from fiona>=1.8->geopandas) (1.1.1)
Requirement already satisfied: attrs>=17 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from fiona>=1.8->geopandas) (22.1.0)
Requirement already satisfied: munch in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from fiona>=1.8->geopandas) (2.5.0)
Requirement already satisfied: setuptools in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from fiona>=1.8->geopandas) (63.2.0)
Requirement already satisfied: click>=4.0 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from fiona>=1.8->geopandas) (8.1.3)
Requirement already satisfied: cligj>=0.5 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from fiona>=1.8->geopandas) (0.7.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas>=1.0.0->geopandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas>=1.0.0->geopandas) (1.23.3)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas>=1.0.0->geopandas) (2022.2.1)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from packaging->geopandas) (3.0.9)

[notice] A new release of pip available: 22.2.2 -> 23.0.1
[notice] To update, run: pip install --upgrade pip

In [13]:
import geopandas as gpd
from shapely.geometry import Point, LineString, Polygon

In [13]:
# Load world map
world = gpd.read_file(gpd.datasets.get_path('naturalearth_lowres'))

stations_coordinates_gpd = gpd.GeoDataFrame(stations_coordinates_df, geometry = gpd.points_from_xy(datahub_airports.longitude, datahub_airports.latitude))

In [6]:
df2 = pd.read_csv("X_2D_arpege_interp_2016.csv")

In [7]:
df2.head()

,Unnamed: 0,number_sta,time,valid_time,ws,p3031,u10,v10,t2m,d2m,r,tp,msl
0,0,86118001,2016-06-20,2016-06-20 00:00:00,2.086929,233.253902,1.664778,1.237922,286.539573,283.093877,79.639350,NaN,102645.854404
1,1,86149001,2016-06-20,2016-06-20 00:00:00,2.185954,245.159387,1.981390,0.919149,286.938202,283.444309,79.446693,NaN,102617.579572
2,2,56081003,2016-06-20,2016-06-20 00:00:00,5.016007,214.343294,2.828977,4.141360,287.489841,286.992310,96.826972,NaN,102395.204634
3,3,53215001,2016-06-20,2016-06-20 00:00:00,3.881939,231.816313,3.050690,2.398041,288.434913,285.401914,82.119988,NaN,102512.548443
4,4,22135001,2016-06-20,2016-06-20 00:00:00,6.180966,207.710636,2.864924,5.468440,287.120840,286.291029,94.758836,NaN,102298.307549

In [8]:
df2.columns

Index(['Unnamed: 0', 'number_sta', 'time', 'valid_time', 'ws', 'p3031', 'u10',
       'v10', 't2m', 'd2m', 'r', 'tp', 'msl'],
      dtype='object')

In [10]:
df3 = pd.read_csv("X_station_train.csv")

In [11]:
df3.head()

,number_sta,date,ff,t,td,hu,dd,precip,Id
0,14066001,2016-01-01 00:00:00,3.05,279.28,277.97,91.4,200.0,0.0,14066001_0_0
1,14066001,2016-01-01 01:00:00,2.57,278.76,277.45,91.4,190.0,0.0,14066001_0_1
2,14066001,2016-01-01 02:00:00,2.26,278.27,277.02,91.7,181.0,0.0,14066001_0_2
3,14066001,2016-01-01 03:00:00,2.62,277.98,276.95,93.0,159.0,0.0,14066001_0_3
4,14066001,2016-01-01 04:00:00,2.99,277.32,276.72,95.9,171.0,0.0,14066001_0_4

In [12]:
df4 = pd.read_csv("Y_train.csv")

In [13]:
df4.head()

         date  number_sta  Ground_truth          Id
0  2016-01-02    14066001           3.4  14066001_0
1  2016-01-02    14126001           0.5  14126001_0
2  2016-01-02    14137001           3.4  14137001_0
3  2016-01-02    14216001           4.0  14216001_0
4  2016-01-02    14296001          13.3  14296001_0

In [19]:
df3[df3.Id=='414066001_0']

Empty DataFrame
Columns: [number_sta, date, ff, t, td, hu, dd, precip, Id]
Index: []